In [ ]:
-- Create employees table
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    first_name TEXT NOT NULL,
    last_name TEXT NOT NULL,
    age INTEGER,
    position TEXT,
    salary REAL,
    hire_date TEXT
);

In [ ]:
-- Insert values into the table
INSERT INTO employees (first_name, last_name, age, position, salary, hire_date) 
VALUES 
    ('John', 'Doe', 28, 'Software Engineer', 75000, '2020-01-15'),
    ('Jane', 'Smith', 34, 'Project Manager', 90000, '2018-07-23'),
    ('Emily', 'Jones', 29, 'Data Analyst', 65000, '2019-11-30'),
    ('Michael', 'Brown', 40, 'CTO', 150000, '2015-06-01'),
    ('Sarah', 'Davis', 31, 'Product Manager', 85000, '2017-09-17');

In [ ]:
-- Select from employees table
SELECT * FROM employees;

In [ ]:
-- Update records
UPDATE employees SET salary = 80000 WHERE first_name = 'John' AND last_name = 'Doe';

In [ ]:
-- Delete record
DELETE FROM employees WHERE first_name = 'Emily' AND last_name = 'Jones';

In [ ]:
-- Filter employees with a specific position
SELECT * FROM employees WHERE position = 'Software Engineer';

In [ ]:
-- The average salary of employees
SELECT AVG(salary) AS average_salary FROM employees;

In [ ]:
-- Count the number of employees
SELECT COUNT(*) AS employee_count FROM employees;

In [ ]:
-- Using and statements
SELECT first_name, last_name, age, salary
FROM employees
WHERE age <30  AND salary > 50000;

In [ ]:
-- Using or operator
SELECT first_name, last_name, age, salary
FROM employees
WHERE age <30 | salary <z` 50000;

In [ ]:
-- add column to table
ALTER TABLE employees ADD COLUMN married BOOLEAN;

In [ ]:
-- rename table
ALTER TABLE employees RENAME TO employees_new;

In [ ]:
-- using the BETWEEN operator
SELECT * FROM employees_new 
WHERE salary BETWEEN 80000 AND 90000